 ![png](ERD_image.png)

In [6]:
from sqlalchemy.engine import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
username = "root"
password = quote_plus("8)2sENx?AlFlHq}d5yU[")
db_name = "books"

connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'
engine = create_engine(connection)

In [7]:
create_database(connection)

In [8]:
database_exists(connection)

True

In [9]:
if database_exists(connection) == False:
    create_database(connection)

else:
    print('The database already exists')

The database already exists

In [11]:
import pandas as pd
df_users = pd.read_csv('data/users.csv')
df_users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [23]:
df_users.to_sql('users', engine, if_exists = 'replace')

3

In [24]:
q = """
SELECT first_name
FROM users;
"""

pd.read_sql(q, engine)

  first_name
0       John
1      Robin
2     Gloria

In [12]:
df_books = pd.read_csv('data/books.csv')
df_books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [25]:
df_books.to_sql('books', engine, if_exists = 'replace')

6

In [26]:
q = """
SELECT title
FROM books;
"""

pd.read_sql(q, engine)

                  title
0           The Shining
1                    It
2      The Great Gatsby
3  The Call of the Wild
4   Pride and Prejudice
5          Frankenstein

In [13]:
df_authors = pd.read_csv('data/authors.csv')
df_authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [27]:
df_authors.to_sql('authors', engine, if_exists = 'replace')

5

In [28]:
q = """
SELECT author_name
FROM authors;
"""

pd.read_sql(q, engine)

         author_name
0       Stephen King
1  F.Scott Fitgerald
2        Jack London
3        Jane Austen
4       Mary Shelley

In [14]:
df_favorites = pd.read_csv('data/favorites.csv')
df_favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [29]:
df_favorites.to_sql('favorites', engine, if_exists = 'replace')

7

In [30]:
q = """
SELECT user_id
FROM favorites;
"""

pd.read_sql(q, engine)

   user_id
0        1
1        1
2        1
3        2
4        2
5        3
6        3

In [31]:
q = """
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""

pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1